tutorials/incompressible/pimpleDyMFoam/propeller/system/removeRedundantZones.topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    innerCylinder;
        type    cellZoneSet;
        action  remove;
    }
    {
        name    innerCylinderSmall;
        type    cellZoneSet;
        action  remove;
    }
);

// ************************************************************************* //
